#+title: Emacs-Lisp Library for converting S-expressions to TOML
#+author: Kaushal Modi

#+options: H:3

#+property: header-args :eval never-export

*NOTE*: This library is in a severe beta stage. It is not ready for any use!! :poop:

[[https://github.com/kaushalmodi/tomelr/actions][https://github.com/kaushalmodi/tomelr/actions/workflows/test.yml/badge.svg]] [[https://www.gnu.org/licenses/gpl-3.0][https://img.shields.io/badge/License-GPL%20v3-blue.svg]]

**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-boolean>>)
#+end_src

#+RESULTS:
: {
:   "bool1": true,
:   "bool2": false
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-integer>>)
#+end_src

#+RESULTS:
: {
:   "int1": 99,
:   "int2": 42,
:   "int3": 0,
:   "int4": -17
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-float>>)
#+end_src

#+RESULTS:
: {
:   "flt1": 1.0,
:   "flt2": 3.1415,
:   "flt3": -0.01,
:   "flt4": 5e+22,
:   "flt5": 1000000.0,
:   "flt6": -0.02,
:   "flt7": 6.626e-34
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-string>>)
#+end_src

#+RESULTS:
: {
:   "str1": "Roses are red",
:   "str2": "Roses are red\nViolets are blue"
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-date>>)
#+end_src

#+RESULTS:
: {
:   "ld1": "1979-05-27"
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<scalar-odt>>)
#+end_src

#+RESULTS:
: {
:   "odt1": "1979-05-27T07:32:00Z",
:   "odt2": "1979-05-27T00:32:00-07:00",
:   "odt3": "1979-05-27T00:32:00.999999-07:00"
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<nil-value>>)
#+end_src

#+RESULTS:
: {
:   "key1": 123,
:   "key2": null,
:   "key3": "abc",
:   "key4": false,
:   "key5": true
: }
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<arrays>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "integers": [
    1,
    2,
    3
  ],
  "integers2": [
    1,
    2,
    3
  ],
  "colors": [
    "red",
    "yellow",
    "green"
  ],
  "numbers": [
    0.1,
    0.2,
    0.5,
    1,
    2,
    5
  ]
}
#+end_example
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<array-of-arrays>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "nested_arrays_of_ints": [
    [
      1,
      2
    ],
    [
      3,
      4,
      5
    ]
  ],
  "nested_mixed_array": [
    [
      1,
      2
    ],
    [
      "a",
      "b",
      "c"
    ]
  ]
}
#+end_example
*** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<tables>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "table-1": {
    "key1": "some string",
    "key2": 123
  },
  "table-2": {
    "key1": "another string",
    "key2": 456
  }
}
#+end_example
*** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<table-arrays>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "products": [
    {
      "name": "Hammer",
      "sku": 738594937
    },
    null,
    {
      "name": "Nail",
      "sku": 284758393,
      "color": "gray"
    }
  ],
  "fruits": [
    {
      "name": "apple",
      "physical": {
        "color": "red",
        "shape": "round"
      },
      "varieties": [
        [
          {
            "name": "red delicious"
          },
          {
            "name": "granny smith"
          }
        ]
      ]
    },
    {
      "name": "banana",
      "varieties": [
        {
          "name": "plantain"
        }
      ]
    }
  ],
  "org_logbook": [
    {
      "timestamp": "2022-04-08T14:53:00-04:00",
      "note": "This note addition prompt shows up on typing the `C-c C-z` binding.\nSee [org#Drawers](https://www.gnu.org/software/emacs/manual/html_mono/org.html#Drawers)."
    },
    {
      "timestamp": "2018-09-06T11:45:00-04:00",
      "note": "Another note **bold** _italics_."
    },
    {
      "timestamp": "2018-09-06T11:37:00-04:00",
      "note": "A note `mono`."
    }
  ]
}
#+end_example
*** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<medley>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "title": "Keyword Collection",
  "author": [
    "firstname1 lastname1",
    "firstname2 lastname2",
    "firstname3 lastname3"
  ],
  "aliases": [
    "/posts/keyword-concatenation",
    "/posts/keyword-merging"
  ],
  "images": [
    "image 1",
    "image 2"
  ],
  "keywords": [
    "keyword1",
    "keyword2",
    "three word keywords3"
  ],
  "outputs": [
    "html",
    "json"
  ],
  "series": [
    "series 1",
    "series 2"
  ],
  "tags": [
    "mega front-matter",
    "keys",
    "collection",
    "concatenation",
    "merging"
  ],
  "categories": [
    "cat1",
    "cat2"
  ],
  "videos": [
    "video 1",
    "video 2"
  ],
  "draft": false,
  "categories_weight": 999,
  "tags_weight": 88,
  "weight": 7,
  "myfoo": "bar",
  "mybaz": "zoo",
  "alpha": 1,
  "beta": "two words",
  "gamma": 10,
  "animals": [
    "dog",
    "cat",
    "penguin",
    "mountain gorilla"
  ],
  "strings-symbols": [
    "abc",
    "def",
    "two words"
  ],
  "integers": [
    123,
    -5,
    17,
    1234
  ],
  "floats": [
    12.3,
    -5.0,
    -1.7e-05
  ],
  "booleans": [
    true,
    false
  ],
  "contributors": [
    "Foo Bar <foo@example.com>",
    {
      "name": "Baz Qux",
      "email": "bazqux@example.com",
      "url": "https://example.com/bazqux"
    }
  ],
  "dog": {
    "legs": 4,
    "eyes": 2,
    "friends": [
      "poo",
      "boo"
    ]
  },
  "header": {
    "image": "projects/Readingabook.jpg",
    "caption": "stay hungry stay foolish"
  },
  "collection": {
    "nothing": false,
    "nonnil": true,
    "animals": [
      "dog",
      "cat",
      "penguin",
      "mountain gorilla"
    ],
    "strings-symbols": [
      "abc",
      "def",
      "two words"
    ],
    "integers": [
      123,
      -5,
      17,
      1234
    ],
    "floats": [
      12.3,
      -5.0,
      -1.7e-05
    ],
    "booleans": [
      true,
      false
    ]
  },
  "menu": {
    "foo": {
      "identifier": "keyword-collection",
      "weight": 10
    }
  },
  "resources": [
    {
      "src": "*.png",
      "name": "my-cool-image-:counter",
      "title": "The Image #:counter",
      "params": {
        "foo": "bar",
        "floats": [
          12.3,
          -5.0,
          -1.7e-05
        ],
        "strings-symbols": [
          "abc",
          "def",
          "two words"
        ],
        "animals": [
          "dog",
          "cat",
          "penguin",
          "mountain gorilla"
        ],
        "integers": [
          123,
          -5,
          17,
          1234
        ],
        "booleans": [
          true,
          false
        ],
        "byline": "bep"
      }
    },
    {
      "src": "image-4.png",
      "title": "The Fourth Image"
    },
    {
      "src": "*.jpg",
      "title": "JPEG Image #:counter"
    }
  ]
}
#+end_example
**** JSON Reference
#+begin_src emacs-lisp :noweb yes :exports results
(json-encode-pretty
  <<p-list>>)
#+end_src

#+RESULTS:
#+begin_example
{
  "int": 123,
  "remove_this_key": null,
  "str": "abc",
  "bool_false": false,
  "bool_true": true,
  "int_list": [
    1,
    2,
    3
  ],
  "str_list": [
    "a",
    "b",
    "c"
  ],
  "bool_list": [
    true,
    false,
    true,
    false
  ],
  "list_of_lists": [
    [
      1,
      2
    ],
    [
      3,
      4,
      5
    ]
  ],
  "map": {
    "key1": 123,
    "key2": "xyz"
  },
  "list_of_maps": [
    {
      "key1": 123,
      "key2": "xyz"
    },
    {
      "key1": 567,
      "key2": "klm"
    }
  ]
}
#+end_example

